var viewDatas = {
  // 大和路与环观南路交叉口（大和站）
  home: {
    posX: -2403104.238563696,
    posY: 5387159.941913258,
    posZ: 2446754.657985789,
    heading: 0.4277303591713224,
    pitch: -1.3255961755545482,
    roll: 0.004107272957088348,
  },
  crossing1: {
    posX: -2398932.3140913825,
    posY: 5376717.518016728,
    posZ: 2445524.3703527823,
    heading: 4.782698831554983,
    pitch: -1.4472027426724576,
    roll: 6.263862396576993,
  },
  // 大和路与人民路交叉口（锦鲤站）
  crossing2: {
    posX: -2398605.0130086592,
    posY: 5376268.830631671,
    posZ: 2446449.787443923,
    heading: 0.03311922748055984,
    pitch: -0.562961779905117,
    roll: 0.00009356256558401554,
  },
  // 大和路与环观南路交叉口（大布头站）
  crossing3: {
    posX: -2400221.4753550533,
    posY: 5375258.9957127785,
    posZ: 2446896.9099828815,
    heading: 4.927621978839134,
    pitch: -0.4141292426265204,
    roll: 6.280638337589227,
  },
  // 大和路与环观南路交叉口（东庵站）
  crossing4: {
    posX: -2399102.4373201616,
    posY: 5376454.920363047,
    posZ: 2445437.289365295,
    heading: 1.9838029928966279,
    pitch: -0.4529756562515024,
    roll: 0.0024284303483961267,
  }
}

var substationDatas = [
  {
    position: { lon: 114.04623628309643, lat: 22.69329422351918, alt: 46.25755820603903 },
    text: {
      名称: 'BDS7',
      网络通信状态: '连接',
    },
    url: '/image/substation.png',
  },
  {
    position: { lon: 114.06899927183208, lat: 22.692448566462723, alt: 81.90728603338627 },
    text: {
      名称: 'BDS7',
      网络通信状态: '连接',
    },
    url: '/image/substation.png',
  },
]